app/Views/partials/admin_sidebar.php

SELECT COUNT(*) AS `numrows`
FROM `sales`
WHERE `is_seen` = 0
SELECT COUNT(*) AS `numrows`
FROM `stock_requests`
WHERE `status` = 'pending'
---
    function isActive($paths) {
        if (!is_array($paths)) $paths = [$paths];
        $currentPath = uri_string();
        foreach ($paths as $path) {
            if ($path === '') {
                if ($currentPath === '') return 'active';
                continue;
            }
            if ($currentPath === $path || strpos($currentPath, $path . '/') === 0 || strpos($currentPath, $path) === 0) {
                return 'active';
            }
        }
        return '';
    }
}

// --- NOTIFICATION QUERIES ---
$db = \Config\Database::connect();

// 1. Sales Records (is_seen = 0)
$salesNotif = $db->table('sales')->where('is_seen', 0)->countAllResults();

// 2. Stock Requests (status = 'pending')
$stockReqNotif = $db->table('stock_requests')->where('status', 'pending')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `expiration_date` IS NOT NULL
AND `expiration_date` != '0000-00-00'
AND `expiration_date` <= '2026-05-12'
AND `expiration_date` >= '2026-05-02'
AND `is_expiring_seen` = 0
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `expiration_date` IS NOT NULL
AND `expiration_date` != '0000-00-00'
AND `expiration_date` < '2026-05-02'
AND `is_expired_seen` = 0
---
// 3. Expiring Soon (0 to 10 days away, is_expiring_seen = 0)
$today = date('Y-m-d');
$expiringDate = date('Y-m-d', strtotime('+10 days'));
$expiringNotif = $db->table('items')
    ->where('expiration_date IS NOT NULL')
    ->where('expiration_date !=', '0000-00-00')
    ->where('expiration_date <=', $expiringDate)
    ->where('expiration_date >=', $today)
    ->where('is_expiring_seen', 0)
    ->countAllResults();

// 4. Expired (< today, is_expired_seen = 0)
$expiredNotif = $db->table('items')
    ->where('expiration_date IS NOT NULL')
    ->where('expiration_date !=', '0000-00-00')
    ->where('expiration_date <', $today)
    ->where('is_expired_seen', 0)
    ->countAllResults();