app/Controllers/ApiController.php

SELECT *
FROM `items`
---
    public function getProducts()
    {
        $this->response->setHeader('Access-Control-Allow-Origin', '*');
        $this->response->setHeader('Access-Control-Allow-Methods', 'GET, OPTIONS');
        $this->response->setHeader('Access-Control-Allow-Headers', 'Content-Type, Authorization');

        if ($this->request->getMethod() === 'options') {
            return $this->response->setStatusCode(200);
        }

        $itemModel = new ItemModel();
        $rawProducts = $itemModel->findAll();

SELECT *
FROM `online_orders`
WHERE `status` = 'Pending'
ORDER BY `created_at` DESC
SELECT *
FROM `online_order_items`
WHERE `order_id` = 'ORD-D12400365'
---
    public function getPendingOrders()
    {
        $this->ensureTablesExist();
        $this->response->setHeader('Access-Control-Allow-Origin', '*');
        $this->response->setHeader('Access-Control-Allow-Methods', 'GET, OPTIONS');
        $this->response->setHeader('Access-Control-Allow-Headers', 'Content-Type, Authorization');

        if ($this->request->getMethod() === 'options') {
            return $this->response->setStatusCode(200);
        }

        $orderModel = new \App\Models\OnlineOrderModel();
        $itemModel = new \App\Models\OnlineOrderItemModel();

        $orders = $orderModel->where('status', 'Pending')->orderBy('created_at', 'DESC')->findAll();

        $result = [];
        foreach ($orders as $order) {
            $items = $itemModel->where('order_id', $order->order_id)->findAll();

SELECT *
FROM `online_orders`
WHERE `order_id` = 'ORD-B60D8E866'
 LIMIT 1
UPDATE `online_orders` SET `status` = 'Completed'
WHERE `online_orders`.`id` IN ('1')
---
    public function confirmOrder()
    {
        $this->ensureTablesExist();

        $this->response->setHeader('Access-Control-Allow-Origin', '*');
        $this->response->setHeader('Access-Control-Allow-Methods', 'POST, OPTIONS');
        $this->response->setHeader('Access-Control-Allow-Headers', 'Content-Type, Authorization');

        if ($this->request->getMethod() === 'options') {
            return $this->response->setStatusCode(200);
        }

        $json = $this->request->getJSON();
        if (!$json || empty($json->order_id)) {
            return $this->respond(['status' => 'error', 'message' => 'Invalid order ID'], 400);
        }

        $orderModel = new \App\Models\OnlineOrderModel();

        $order = $orderModel->where('order_id', $json->order_id)->first();
        if (!$order) {
            return $this->respond(['status' => 'error', 'message' => 'Order not found'], 404);
        }

        $orderModel->update($order->id, ['status' => 'Completed']);