app/Controllers/Items.php

    public function index()
    {
        $model = new ItemModel();
        $deletedModel = new DeletedItemModel();

        date_default_timezone_set('Asia/Manila');

        $today = date('Y-m-d');
        $warningDays = 10;

        $updatedItems = [];
        $items = $model->orderBy('created_at', 'ASC')->findAll();
---
SELECT *
FROM `items`
ORDER BY `created_at` ASC

            }

            if (!isset($item['status']) || $item['status'] !== $status) {
                $model->update($item['id'], ['status' => $status]);
---
UPDATE `items` SET `status` = 'expiring soon', `updated_at` = '2026-05-02 12:54:17'
WHERE `items`.`id` IN ('5615')

                !in_array($item['status'], ['manually deleted', 'unconsumed'])
            ) {
                $salesModel = new \App\Models\SalesModel();
                $saleCount = $salesModel->where('product_id', $item['product_id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `sales`
WHERE `product_id` = 'P005'

        ")->getResultArray();

        foreach ($topSalesQuery as &$ts) {
            $product = $itemModel->find($ts['product_id']);
---
SELECT *
FROM `items`
WHERE `items`.`id` = '5617'

    public function dashboard()
    {
        $model = new ItemModel();
        $deletedModel = new DeletedItemModel();

        date_default_timezone_set('Asia/Manila');

        $today = date('Y-m-d');
        $warningDays = 10;

        $updatedItems = [];
        $items = $model->orderBy('created_at', 'ASC')->findAll();
---
SELECT *
FROM `items`
ORDER BY `created_at` ASC

            }

            if (!isset($item['status']) || $item['status'] !== $status) {
                $model->update($item['id'], ['status' => $status]);
---
UPDATE `items` SET `status` = 'expiring soon', `updated_at` = '2026-05-02 12:54:13'
WHERE `items`.`id` IN ('5615')

                !in_array($item['status'], ['manually deleted', 'unconsumed'])
            ) {
                $salesModel = new \App\Models\SalesModel();
                $saleCount = $salesModel->where('product_id', $item['product_id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `sales`
WHERE `product_id` = 'P005'

        ")->getResultArray();

        foreach ($topSalesQuery as &$ts) {
            $product = $itemModel->find($ts['product_id']);
---
SELECT *
FROM `items`
WHERE `items`.`id` = '5617'