app/Controllers/SalesController.php

    public function index()
    {
        // Mark sales as seen to clear the notification badge atomically
        $this->salesModel->db->transStart();
        $this->salesModel->where('is_seen', 0)->set(['is_seen' => 1])->update();
        $this->salesModel->db->transComplete();

        $sales = $this->salesModel
            ->select('sales.*, products.name as product_name, users.username as user_name')
            ->join('products', 'products.id = sales.product_id', 'left')
            ->join('users', 'users.id = sales.user_id', 'left')
            ->orderBy('sales.created_at', 'DESC')
            ->findAll();
---
UPDATE `sales` SET `is_seen` = 1
WHERE `is_seen` = 0
SELECT `sales`.*, `products`.`name` as `product_name`, `users`.`username` as `user_name`
FROM `sales`
LEFT JOIN `products` ON `products`.`id` = `sales`.`product_id`
LEFT JOIN `users` ON `users`.`id` = `sales`.`user_id`
ORDER BY `sales`.`created_at` DESC